/* ৩. আরেকটা ফাংশন লিখবে যেটার নাম লিখবে।
 যেই ফাংশনের নাম হবে paperRequirements এই ফাংশনের প্যারামিটার হিসেবে তিনটা প্যারামিটার হবে। 
 প্রথম প্যারামিটার হবে তুমি প্রথম বই কত কপি ছাপাতে চাও। 
 সেকেন্ড প্যারামিটার হবে তুমি সেকেন্ড বই কত কপি ছাপাতে চাও।
  আর থার্ড প্যারামিটার হবে তুমি থার্ড বই কত কপি ছাপাতে চাও। 
  অর্থাৎ কোন বই এর কত কপি ছাপানো হবে সেটাই প্যারামিটার হিসেবে নিবে। 

এইবার ভালো করে খেয়াল করো। 

প্রথম বই ছাপানোর জন্য পৃষ্ঠা লাগবে ১০০ টা 

সেকেন্ড বই ছাপানোর জন্য পৃষ্ঠা লাগবে ২০০ টা 

তৃতীয় বই ছাপানোর জন্য পৃষ্ঠা লাগবে ৩০০ টা 

 */

function paperRequirements(prm1 , prm2 , prm3){
    let book_1 = 100;
    let book_2 = 200; 
    let book_3 = 300;
    //---------------- First Book Calculation----------------// 
    let first = prm1 * book_1 ;
    //---------------- Second Book Calculation----------------// 
    let second = prm2 * book_2 ; 
    //---------------- Third Book Calculation----------------// 
    let third = prm3 * book_3 ; 
    //---------------- Total Count------------------------// 
    let total = first + second + third ;
    //----------------Return----------------// 
    return total ; 
}

let myBangla = paperRequirements(2,6,1);
console.log(myBangla);